vanbuong/Integrated-Watering-System/STM32F103_Code/main.c
/**
  ******************************************************************************
  * @file    Project/STM32F10x_StdPeriph_Template/main.c 
  * @author  MCD Application Team
  * @version V3.5.0
  * @date    08-April-2011
  * @brief   Main program body
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */  

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include <stdio.h>
#include "TIMER/TIMER.h"
#include "LCD/LCD.h"
#include "INPUT165/INPUT165.h"
#include "DS1307/DS1307.h"
#include "GPIO/GPIO.h"
#include "EEPROM/EEPROM.h"

/** @addtogroup STM32F10x_StdPeriph_Template
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define     DISPLAY_TIME    0x50
#define     SHOW_SETTIME    0x51
#define     SHOW_WATERCALEN 0x52
#define			SHOW_LOADCALEN	0x53
#define			SHOW_CREATECALEN 0x54
#define     SETUP_TIME      0x55
#define 		LOAD_CALENDAR		0x56
#define 		CREATE_CALENDAR	0x57

#define     SETUP_DAY       0x10
#define     SETUP_HOUR      0x11
#define     SETUP_MINUTE    0x12
#define     SETUP_SECOND    0x13
#define     SETUP_MODE_TIME 0x14
#define     SETUP_MONTH     0x15
#define     SETUP_DATE      0x16
#define     SETUP_YEAR      0x17
#define     SETUP_SAVE      0x18
#define     SETUP_BACK      0x19

#define			MONDAY					0x02
#define			TUESDAY					0x03
#define			WEDNESDAY				0x04
#define			THUSDAY					0x05
#define			FRIDAY					0x06
#define			SATURDAY				0x07
#define			SUNDAY					0x01

#define			TIMER1					0x22
#define			TIMER2					0x23
#define			TIMER3					0x24
#define			TIMER4					0x25
#define			TIMER5					0x26
#define			TIMER6					0x27
#define			TIMER7					0x28
#define			TIMER8					0x29
#define			TIMER9					0x2A
#define			TIMER10					0x2B
#define			TIMER11					0x2C
#define			TIMER12					0x2D
#define			TIMER13					0x2E
#define			TIMER14					0x2F
#define			TIMER15					0x30
#define			TIMER16					0x31

#define			SHOW_FULL_WEEK	0x32
#define			SHOW_ODD_DAYS		0x33
#define			SHOW_EVEN_DAYS	0x34
#define			SHOW_CHOOSE_DAYS	0x35
#define			FULL_WEEK				0x36
#define			ODD_DAYS				0x37
#define			EVEN_DAYS				0x38
#define			CHOOSE_DAYS			0x39

#define			CRC_4BYTES			0x3FFC

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
uint32_t CRC_EEPROM 		= 0x5F29A0B2;
uint32_t CRCValue				= 0;
uint32_t CRCTemp				= 0;
uint8_t isWatering			= 0;
uint8_t MainState 			= DISPLAY_TIME;
uint8_t SetupTimeState 	= SETUP_DAY;
uint8_t	TimerState			= TIMER1;
uint8_t	LoadDay					= MONDAY;
uint8_t CreateModeState = SHOW_FULL_WEEK;
uint8_t WriteEEPROMState= 0xff;
uint8_t time_delay 			= 0;
uint8_t isFlicker 			= 0;
uint8_t enableWriteEEPROM = 0;
uint8_t Monday[64] 			= {0};
uint8_t Tuesday[64] 		= {0};
uint8_t Wednesday[64] 	= {0};
uint8_t Thusday[64] 		= {0};
uint8_t Friday[64] 			= {0};
uint8_t Saturday[64] 		= {0};
uint8_t Sunday[64] 			= {0};

/* Private function prototypes -----------------------------------------------*/
void InitSystem(void);
void DisplayFlicker(void);
void SetupTime(void);
void CreateCalendar(void);
void LoadCalendar(void);
void LoadTimer(void);
void PrintTimer(uint8_t row, uint8_t col, uint8_t num);
void WriteCalendarEEPROM(void);
void InitCalendarEEPROM(void);
void Watering(void);
void CheckWatering(uint8_t *day_watering);
/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */
int main(void)
{

  /* Add your application code here
     */
	InitSystem();
	InitCalendarEEPROM();
	_delay_ms(1000);

  /* Infinite loop */
  while (1)
  {
		_delay_ms(10);
		LCD1602_ClearBFR();
		Keyboard_Scan();
		
		switch (MainState) 
			{
					case DISPLAY_TIME: 
							DisplayTime();
							if (isNextButton())
							{
									MainState = SHOW_SETTIME;
									time_delay = 0;
									isFlicker = 0;
							}
							if (isPreviousButton())
									MainState = SHOW_WATERCALEN;
							break;
					case SHOW_SETTIME:
							LCD1602_ClearBFR();
							LCD1602_PrintStringBFR(0,0,"<  SETUP TIME  >");
							if (isNextButton()) 
									MainState = SHOW_WATERCALEN;
							if (isPreviousButton())
									MainState = DISPLAY_TIME;
							if (isEnterButton())
							{
									MainState = SETUP_TIME;
									time_delay = 0;
									isFlicker = 0;
							}
							if (isBackButton())
									MainState = DISPLAY_TIME;
							break;
					case SHOW_WATERCALEN:
							LCD1602_ClearBFR();
							LCD1602_PrintStringBFR(0,0,"<WATER CALENDAR>");
							if (isNextButton())
									MainState = DISPLAY_TIME;
							if (isPreviousButton())
									MainState = SHOW_SETTIME;
							if (isEnterButton())
									MainState = SHOW_LOADCALEN;
							if (isBackButton())
									MainState = DISPLAY_TIME;
							break;
					case SHOW_LOADCALEN:
							LCD1602_ClearBFR();
							LCD1602_PrintStringBFR(0,0,"< LOAD CALENDAR>");
							if (isNextButton())
									MainState = SHOW_CREATECALEN;
							if (isPreviousButton())
									MainState = SHOW_CREATECALEN;
							if (isBackButton())
									MainState = SHOW_WATERCALEN;
							if (isEnterButton())
									MainState = LOAD_CALENDAR;
							break;
					case SHOW_CREATECALEN:
							LCD1602_ClearBFR();
							LCD1602_PrintStringBFR(0,0,"<CREATE CALENDA>");
							if (isNextButton())
									MainState = SHOW_LOADCALEN;
							if (isPreviousButton())
									MainState = SHOW_LOADCALEN;
							if (isBackButton())
									MainState = SHOW_WATERCALEN;
							if (isEnterButton())
									MainState = CREATE_CALENDAR;
							break;
					case SETUP_TIME:
							LCD1602_ClearBFR();
							SetupTime();
							break;
					case LOAD_CALENDAR:
							LCD1602_ClearBFR();
							LoadCalendar();
							break;
					case CREATE_CALENDAR:
							LCD1602_ClearBFR();
							CreateCalendar();
							break;
					default:
							break;
			}
			Watering();
			WriteCalendarEEPROM();
			LCD1602_Display();
  }
}

/* Private functions ---------------------------------------------------------*/
void InitSystem(void) 
{
	SysTick_Init();
	LCD_Init(LCD_1602);
	LCD1602_Clear();
	LCD1602_ClearBFR();
	GPIOx_Init();
	Keyboard_Init();
	DS1307_Init();
	EEPROM_Init();
	LED1(0);
	LED2(0);
	
	/* Enable CRC clock */
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_CRC, ENABLE);
	
