vanbuong/Integrated-Watering-System/STM32F103_Code/main.c
}

void DisplayFlicker(void)
{
    switch (SetupTimeState)
    {
        case SETUP_DAY:
            time_delay = time_delay + 1;
            if (isFlicker == 0)
            {
                LCD1602_PrintStringBFR(0,0,"   ");
            }
            if (time_delay >= 10) 
            {
                time_delay = 0;
                if (isFlicker == 0)
                    isFlicker = 1;
                else 
                    isFlicker = 0;
            }
            break;
        case SETUP_HOUR:
            time_delay = time_delay + 1;
            if (isFlicker == 0)
            {
                LCD1602_PrintStringBFR(0,4,"  ");
            }
            if (time_delay >= 10) 
            {
                time_delay = 0;
                if (isFlicker == 0)
                    isFlicker = 1;
                else 
                    isFlicker = 0;
            }
            break;
        case SETUP_MINUTE:
            time_delay = time_delay + 1;
            if (isFlicker == 0)
            {
                LCD1602_PrintStringBFR(0,7,"  ");
            }
            if (time_delay >= 10) 
            {
                time_delay = 0;
                if (isFlicker == 0)
                    isFlicker = 1;
                else 
                    isFlicker = 0;
            }
            break;
        case SETUP_SECOND:
            time_delay = time_delay + 1;
            if (isFlicker == 0)
            {
                LCD1602_PrintStringBFR(0,10,"  ");
            }
            if (time_delay >= 10) 
            {
                time_delay = 0;
                if (isFlicker == 0)
                    isFlicker = 1;
                else 
                    isFlicker = 0;
            }
            break;
        case SETUP_MODE_TIME:
            time_delay = time_delay + 1;
            if (isFlicker == 0)
            {
                LCD1602_PrintStringBFR(0,14,"  ");
            }
            if (time_delay >= 10) 
            {
                time_delay = 0;
                if (isFlicker == 0)
                    isFlicker = 1;
                else 
                    isFlicker = 0;
            }
            break;
        case SETUP_YEAR:
            time_delay = time_delay + 1;
            if (isFlicker == 0)
            {
                LCD1602_PrintStringBFR(1,9,"    ");
            }
            if (time_delay >= 10) 
            {
                time_delay = 0;
                if (isFlicker == 0)
                    isFlicker = 1;
                else 
                    isFlicker = 0;
            }
            break;
        case SETUP_MONTH:
            time_delay = time_delay + 1;
            if (isFlicker == 0)
            {
                LCD1602_PrintStringBFR(1,2,"   ");
            }
            if (time_delay >= 10) 
            {
                time_delay = 0;
                if (isFlicker == 0)
                    isFlicker = 1;
                else 
                    isFlicker = 0;
            }
            break;
        case SETUP_DATE:
            time_delay = time_delay + 1;
            if (isFlicker == 0)
            {
                LCD1602_PrintStringBFR(1,6,"  ");
            }
            if (time_delay >= 10) 
            {
                time_delay = 0;
                if (isFlicker == 0)
                    isFlicker = 1;
                else 
                    isFlicker = 0;
            }
            break;
        default:
            break;
        
    }
}

void SetupTime(void)
{
    switch (SetupTimeState)
    {
        case SETUP_DAY:
            if (isUpButton())
            {
                day = day + 1;
                if (day == 8)
                    day = 1;
            }
            if (isDownButton())
            {
                day = day - 1;
                if (day == 0)
                    day = 7;
            }
            if (isSwitchButton())
            {
                SetupTimeState = SETUP_HOUR;
                time_delay = 0;
            }
            if (isBackButton()) 
                SetupTimeState = SETUP_BACK;
            if (isSaveButton())
                SetupTimeState = SETUP_SAVE;
            break;
        case SETUP_HOUR:
            if (isUpButton())
            {
                hour = hour + 1;
                if (hour == 24)
                    hour = 0;
            }
            if (isDownButton())
            {
                if (hour == 0)
                    hour = 24;
                hour = hour - 1;
                
            }
            if (isSwitchButton())
            {
                SetupTimeState = SETUP_MINUTE;
                time_delay = 0;
            }
            if (isBackButton()) 
                SetupTimeState = SETUP_BACK;
            if (isSaveButton())
                SetupTimeState = SETUP_SAVE;
            break;
        case SETUP_MINUTE:
            if (isUpButton())
            {
                minute = minute + 1;
                if (minute == 60)
                    minute = 0;
            }
            if (isDownButton())
            {
                if (minute == 0)
                    minute = 60;
                minute = minute - 1; 
            }
            if (isSwitchButton())
            {
                SetupTimeState = SETUP_SECOND;
                time_delay = 0;
            }
            if (isBackButton()) 
                SetupTimeState = SETUP_BACK;
            if (isSaveButton())
                SetupTimeState = SETUP_SAVE;
            break;
        case SETUP_SECOND:
            if (isUpButton())
            {
                second = second + 1;
                if (second == 60)
                    second = 0;
            }
            if (isDownButton())
            {
                if (second == 0)
                    second = 60;
                second = second - 1; 
            }
            if (isSwitchButton())
            {
                SetupTimeState = SETUP_YEAR;
                time_delay = 0;
            }
            if (isBackButton()) 
                SetupTimeState = SETUP_BACK;
            if (isSaveButton())
                SetupTimeState = SETUP_SAVE;
            break;
        case SETUP_MODE_TIME:
            if (isSwitchButton())
            {
                SetupTimeState = SETUP_YEAR;
                time_delay = 0;
            }
            if (isBackButton()) 
                SetupTimeState = SETUP_BACK;
            if (isSaveButton())
                SetupTimeState = SETUP_SAVE;
            break;
        case SETUP_YEAR:
            if (isUpButton())
            {
                year = year + 1;
                if (year == 100)
                    year = 0;
            }
            if (isDownButton())
            {
                if (year == 0)
                    year = 100;
                year = year - 1; 
            }
            if (isSwitchButton())
            {
                SetupTimeState = SETUP_MONTH;
                time_delay = 0;
            }
            if (isBackButton()) 
                SetupTimeState = SETUP_BACK;
            if (isSaveButton())
                SetupTimeState = SETUP_SAVE;
            break;
        case SETUP_MONTH:
            if (isUpButton())
            {
                month = month + 1;
                if (month == 13)
                    month = 1;
            }
            if (isDownButton())
            {
                month = month - 1; 
                if (month == 0)
                    month = 12;
            }
            if (isSwitchButton())
            {
                SetupTimeState = SETUP_DATE;
                time_delay = 0;
            }
            if (isBackButton()) 
                SetupTimeState = SETUP_BACK;
            if (isSaveButton())
                SetupTimeState = SETUP_SAVE;
            break;
        case SETUP_DATE:
            if (isUpButton())
            {
                date = date + 1;
                switch (month)
                {
                    case 1: case 3: case 5: case 7: case 8: case 10: case 12:
                        if (date == 32)
                            date = 1;
                        break;
                    case 4: case 6: case 9: case 11:
                        if (date == 31)
                            date = 1;
                        break;
                    case 2:
                        if (isLeapYear(year))
                        {
                            if (date == 30)
                                date = 1;
                        }
                        else
                        {
                            if (date == 29)
                                date = 1;
                        }
                        break;
                    default:
                        break;
                }
            }
            if (isDownButton())
            {
                date = date - 1;
                switch (month)
                {
                    case 1: case 3: case 5: case 7: case 8: case 10: case 12:
                        if (date == 0)
                            date = 31;
                        break;
                    case 4: case 6: case 9: case 11:
                        if (date == 0)
                            date = 30;
                        break;
                    case 2:
                        if (isLeapYear(year))
                        {
                            if (date == 0)
                                date = 29;
                        }
                        else
                        {
                            if (date == 0)
                                date = 28;
                        }
                        break;
                    default:
                        break;
                }
            }
            if (isSwitchButton())
            {
                SetupTimeState = SETUP_DAY;
                time_delay = 0;
            }
            if (isBackButton()) 
                SetupTimeState = SETUP_BACK;
            if (isSaveButton())
                SetupTimeState = SETUP_SAVE;
            break;
        case SETUP_SAVE:
            SetupTimeForRealTime();
            MainState = SHOW_SETTIME;
            SetupTimeState = SETUP_DAY;
            break;
        case SETUP_BACK:
            MainState = SHOW_SETTIME;
            SetupTimeState = SETUP_DAY;
            break;
        default:
            break;
    }
    DisplayTimeOnLCD1602();
    DisplayFlicker();
}

void InitCalendarEEPROM(void)
{
	/* Compute the CRC of "CRC_EEPROM" */
  CRCValue = CRC_CalcCRC(CRC_EEPROM);
	
	/* Read four byte at the last memory page of EEPROM */
	CRCTemp = EEPROM_ReadLong(CRC_4BYTES);
	
	/* Reset CRC DR Register */
	CRC_ResetDR();
	
	/* Compute the CRC of "CRCTemp" */
	CRCTemp = CRC_CalcCRC(CRCTemp);
	
