vanbuong/Integrated-Watering-System/STM32F103_Code/main.c
	if (CRCValue == CRCTemp) 
	{
		/* Read data from EEPROM */
		EEPROM_ReadPage(0x0000, Monday);
		EEPROM_ReadPage(0x0040, Tuesday);
		EEPROM_ReadPage(0x0080, Wednesday);
		EEPROM_ReadPage(0x00C0, Thusday);
		EEPROM_ReadPage(0x0100, Friday);
		EEPROM_ReadPage(0x0140, Saturday);
		EEPROM_ReadPage(0x0180, Sunday);
	}
	else
	{
		/* Init data and write to EEPROM */
		uint8_t i;
		for (i=0;i<64;i++)
		{
			Monday[i] 		= 0;
			Tuesday[i] 		= 0;
			Wednesday[i] 	= 0;
			Thusday[i] 		= 0;
			Friday[i] 		= 0;
			Saturday[i] 	= 0;
			Sunday[i] 		= 0;
		}
		Sunday[4] = 15;
		Sunday[5] = 55;
		Sunday[6] = 0;
		Sunday[7] = 15;
		EEPROM_WritePage(0x0000, Monday);
		_delay_ms(3);
		EEPROM_WritePage(0x0040, Tuesday);
		_delay_ms(3);
		EEPROM_WritePage(0x0080, Wednesday);
		_delay_ms(3);
		EEPROM_WritePage(0x00C0, Thusday);
		_delay_ms(3);
		EEPROM_WritePage(0x0100, Friday);
		_delay_ms(3);
		EEPROM_WritePage(0x0140, Saturday);
		_delay_ms(3);
		EEPROM_WritePage(0x0180, Sunday);
		_delay_ms(3);
		EEPROM_WriteLong(0x3FFC, CRC_EEPROM);
	}
	
}

void WriteCalendarEEPROM(void)
{
	switch (WriteEEPROMState)
	{
		case MONDAY:
			EEPROM_WritePage(0x0000, Monday);
			WriteEEPROMState = TUESDAY;
			break;
		case TUESDAY:
			EEPROM_WritePage(0x0040, Tuesday);
			WriteEEPROMState = WEDNESDAY;
			break;
		case WEDNESDAY:
			EEPROM_WritePage(0x0080, Wednesday);
			WriteEEPROMState = THUSDAY;
			break;
		case THUSDAY:
			EEPROM_WritePage(0x00C0, Thusday);
			WriteEEPROMState = FRIDAY;
			break;
		case FRIDAY:
			EEPROM_WritePage(0x0100, Friday);
			WriteEEPROMState = SATURDAY;
			break;
		case SATURDAY:
			EEPROM_WritePage(0x0140, Saturday);
			WriteEEPROMState = SUNDAY;
			break;
		case SUNDAY:
			EEPROM_WritePage(0x0180, Sunday);
			WriteEEPROMState = 0xff;
			break;
		default:
			break;
	}
}
void PrintTimer(uint8_t row, uint8_t col, uint8_t num)
{
	LCD1602_PrintNumBFR(row, col, num/10);
	LCD1602_PrintNumBFR(row, col+1, num%10);
}

void LoadTimer(void)
{
	uint8_t TimerTemp[64];
	uint8_t i;
	switch (LoadDay)
	{
		case MONDAY:
			for (i = 0; i<64; i++) 
				TimerTemp[i] = Monday[i];
			break;
		case TUESDAY:
			for (i = 0; i<64; i++) 
				TimerTemp[i] = Tuesday[i];
			break;
		case WEDNESDAY:
			for (i = 0; i<64; i++) 
				TimerTemp[i] = Wednesday[i];
			break;
		case THUSDAY:
			for (i = 0; i<64; i++) 
				TimerTemp[i] = Thusday[i];
			break;
		case FRIDAY:
			for (i = 0; i<64; i++) 
				TimerTemp[i] = Friday[i];
			break;
		case SATURDAY:
			for (i = 0; i<64; i++) 
				TimerTemp[i] = Saturday[i];
			break;
		case SUNDAY:
			for (i = 0; i<64; i++) 
				TimerTemp[i] = Sunday[i];
			break;
		default:
			break;
	}
	
	switch (TimerState)
	{
		case TIMER1:
			LCD1602_PrintStringBFR(1,0,"TMR1 ");
			PrintTimer(0,11,TimerTemp[0]);
			PrintTimer(0,14,TimerTemp[1]);
			PrintTimer(1,11,TimerTemp[2]);
			PrintTimer(1,14,TimerTemp[3]);
			if (isDownButton())
				TimerState = TIMER2;
			if (isUpButton())
				TimerState = TIMER16;
			break;
		case TIMER2:
			LCD1602_PrintStringBFR(1,0,"TMR2 ");
			PrintTimer(0,11,TimerTemp[4]);
			PrintTimer(0,14,TimerTemp[5]);
			PrintTimer(1,11,TimerTemp[6]);
			PrintTimer(1,14,TimerTemp[7]);
			if (isDownButton())
				TimerState = TIMER3;
			if (isUpButton())
				TimerState = TIMER1;
			break;
		case TIMER3:
			LCD1602_PrintStringBFR(1,0,"TMR3 ");
			PrintTimer(0,11,TimerTemp[8]);
			PrintTimer(0,14,TimerTemp[9]);
			PrintTimer(1,11,TimerTemp[10]);
			PrintTimer(1,14,TimerTemp[11]);
			if (isDownButton())
				TimerState = TIMER4;
			if (isUpButton())
				TimerState = TIMER2;
			break;
		case TIMER4:
			LCD1602_PrintStringBFR(1,0,"TMR4 ");
			PrintTimer(0,11,TimerTemp[12]);
			PrintTimer(0,14,TimerTemp[13]);
			PrintTimer(1,11,TimerTemp[14]);
			PrintTimer(1,14,TimerTemp[15]);
			if (isDownButton())
				TimerState = TIMER5;
			if (isUpButton())
				TimerState = TIMER3;
			break;
		case TIMER5:
			LCD1602_PrintStringBFR(1,0,"TMR5 ");
			PrintTimer(0,11,TimerTemp[16]);
			PrintTimer(0,14,TimerTemp[17]);
			PrintTimer(1,11,TimerTemp[18]);
			PrintTimer(1,14,TimerTemp[19]);
			if (isDownButton())
				TimerState = TIMER6;
			if (isUpButton())
				TimerState = TIMER4;
			break;
		case TIMER6:
			LCD1602_PrintStringBFR(1,0,"TMR6 ");
			PrintTimer(0,11,TimerTemp[20]);
			PrintTimer(0,14,TimerTemp[21]);
			PrintTimer(1,11,TimerTemp[22]);
			PrintTimer(1,14,TimerTemp[23]);
			if (isDownButton())
				TimerState = TIMER7;
			if (isUpButton())
				TimerState = TIMER5;
			break;
		case TIMER7:
			LCD1602_PrintStringBFR(1,0,"TMR7 ");
			PrintTimer(0,11,TimerTemp[24]);
			PrintTimer(0,14,TimerTemp[25]);
			PrintTimer(1,11,TimerTemp[26]);
			PrintTimer(1,14,TimerTemp[27]);
			if (isDownButton())
				TimerState = TIMER8;
			if (isUpButton())
				TimerState = TIMER6;
			break;
		case TIMER8:
			LCD1602_PrintStringBFR(1,0,"TMR8 ");
			PrintTimer(0,11,TimerTemp[28]);
			PrintTimer(0,14,TimerTemp[29]);
			PrintTimer(1,11,TimerTemp[30]);
			PrintTimer(1,14,TimerTemp[31]);
			if (isDownButton())
				TimerState = TIMER9;
			if (isUpButton())
				TimerState = TIMER7;
			break;
		case TIMER9:
			LCD1602_PrintStringBFR(1,0,"TMR9 ");
			PrintTimer(0,11,TimerTemp[32]);
			PrintTimer(0,14,TimerTemp[33]);
			PrintTimer(1,11,TimerTemp[34]);
			PrintTimer(1,14,TimerTemp[35]);
			if (isDownButton())
				TimerState = TIMER10;
			if (isUpButton())
				TimerState = TIMER8;
			break;
		case TIMER10:
			LCD1602_PrintStringBFR(1,0,"TMR10");
			PrintTimer(0,11,TimerTemp[36]);
			PrintTimer(0,14,TimerTemp[37]);
			PrintTimer(1,11,TimerTemp[38]);
			PrintTimer(1,14,TimerTemp[39]);
			if (isDownButton())
				TimerState = TIMER11;
			if (isUpButton())
				TimerState = TIMER9;
			break;
		case TIMER11:
			LCD1602_PrintStringBFR(1,0,"TMR11");
			PrintTimer(0,11,TimerTemp[40]);
			PrintTimer(0,14,TimerTemp[41]);
			PrintTimer(1,11,TimerTemp[42]);
			PrintTimer(1,14,TimerTemp[43]);
			if (isDownButton())
				TimerState = TIMER12;
			if (isUpButton())
				TimerState = TIMER10;
			break;
		case TIMER12:
			LCD1602_PrintStringBFR(1,0,"TMR12");
			PrintTimer(0,11,TimerTemp[44]);
			PrintTimer(0,14,TimerTemp[45]);
			PrintTimer(1,11,TimerTemp[46]);
			PrintTimer(1,14,TimerTemp[47]);
			if (isDownButton())
				TimerState = TIMER13;
			if (isUpButton())
				TimerState = TIMER11;
			break;
		case TIMER13:
			LCD1602_PrintStringBFR(1,0,"TMR13");
			PrintTimer(0,11,TimerTemp[48]);
			PrintTimer(0,14,TimerTemp[49]);
			PrintTimer(1,11,TimerTemp[50]);
			PrintTimer(1,14,TimerTemp[51]);
			if (isDownButton())
				TimerState = TIMER14;
			if (isUpButton())
				TimerState = TIMER12;
			break;
		case TIMER14:
			LCD1602_PrintStringBFR(1,0,"TMR14");
			PrintTimer(0,11,TimerTemp[52]);
			PrintTimer(0,14,TimerTemp[53]);
			PrintTimer(1,11,TimerTemp[54]);
			PrintTimer(1,14,TimerTemp[55]);
			if (isDownButton())
				TimerState = TIMER15;
			if (isUpButton())
				TimerState = TIMER13;
			break;
		case TIMER15:
			LCD1602_PrintStringBFR(1,0,"TMR15");
			PrintTimer(0,11,TimerTemp[56]);
			PrintTimer(0,14,TimerTemp[57]);
			PrintTimer(1,11,TimerTemp[58]);
			PrintTimer(1,14,TimerTemp[59]);
			if (isDownButton())
				TimerState = TIMER16;
			if (isUpButton())
				TimerState = TIMER14;
			break;
		case TIMER16:
			LCD1602_PrintStringBFR(1,0,"TMR16");
			PrintTimer(0,11,TimerTemp[60]);
			PrintTimer(0,14,TimerTemp[61]);
			PrintTimer(1,11,TimerTemp[62]);
			PrintTimer(1,14,TimerTemp[63]);
			if (isDownButton())
				TimerState = TIMER1;
			if (isUpButton())
				TimerState = TIMER15;
			break;
		default: 
			break;
	}
	
