vanbuong/Integrated-Watering-System/STM32F103_Code/main.c
}

void LoadCalendar(void)
{
	switch (LoadDay)
	{
		case MONDAY:
			LCD1602_ClearBFR();
			LCD1602_PrintStringBFR(0, 0, "MON  START 00:00");
			LCD1602_PrintStringBFR(1, 0, "TMR1   RUN 00:00");
			LoadTimer();
			if (isNextButton())
			{
				TimerState = TIMER1;
				LoadDay = TUESDAY;
			}			
			if (isPreviousButton())
			{
				TimerState = TIMER1;
				LoadDay = SUNDAY;
			}
			if (isBackButton())
			{
				TimerState = TIMER1;
				LoadDay = MONDAY;
				MainState = SHOW_LOADCALEN;
			}
			break;
		case TUESDAY:
			LCD1602_ClearBFR();
			LCD1602_PrintStringBFR(0, 0, "TUE  START 00:00");
			LCD1602_PrintStringBFR(1, 0, "TMR1   RUN 00:00");
			LoadTimer();
			if (isNextButton())
			{
				TimerState = TIMER1;
				LoadDay = WEDNESDAY;
			}
			if (isPreviousButton())
			{
				TimerState = TIMER1;
				LoadDay = MONDAY;
			}
			if (isBackButton())
			{
				TimerState = TIMER1;
				LoadDay = MONDAY;
				MainState = SHOW_LOADCALEN;
			}
			break;
		case WEDNESDAY:
			LCD1602_ClearBFR();
			LCD1602_PrintStringBFR(0, 0, "WED  START 00:00");
			LCD1602_PrintStringBFR(1, 0, "TMR1   RUN 00:00");
			LoadTimer();
			if (isNextButton())
			{
				TimerState = TIMER1;
				LoadDay = THUSDAY;
			}
			if (isPreviousButton())
			{
				TimerState = TIMER1;
				LoadDay = TUESDAY;
			}
			if (isBackButton())
			{
				TimerState = TIMER1;
				LoadDay = MONDAY;
				MainState = SHOW_LOADCALEN;
			}
			break;
		case THUSDAY:
			LCD1602_ClearBFR();
			LCD1602_PrintStringBFR(0, 0, "THU  START 00:00");
			LCD1602_PrintStringBFR(1, 0, "TMR1   RUN 00:00");
			LoadTimer();
			if (isNextButton())
			{
				TimerState = TIMER1;
				LoadDay = FRIDAY;
			}
			if (isPreviousButton())
			{
				TimerState = TIMER1;
				LoadDay = WEDNESDAY;
			}
			if (isBackButton())
			{
				TimerState = TIMER1;
				LoadDay = MONDAY;
				MainState = SHOW_LOADCALEN;
			}
			break;
		case FRIDAY:
			LCD1602_ClearBFR();
			LCD1602_PrintStringBFR(0, 0, "FRI  START 00:00");
			LCD1602_PrintStringBFR(1, 0, "TMR1   RUN 00:00");
			LoadTimer();
			if (isNextButton())
			{
				TimerState = TIMER1;
				LoadDay = SATURDAY;
			}
			if (isPreviousButton())
			{
				TimerState = TIMER1;
				LoadDay = THUSDAY;
			}
			if (isBackButton())
			{
				TimerState = TIMER1;
				LoadDay = MONDAY;
				MainState = SHOW_LOADCALEN;
			}
			break;
		case SATURDAY:
			LCD1602_ClearBFR();
			LCD1602_PrintStringBFR(0, 0, "SAT  START 00:00");
			LCD1602_PrintStringBFR(1, 0, "TMR1   RUN 00:00");
			LoadTimer();
			if (isNextButton())
			{
				TimerState = TIMER1;
				LoadDay = SUNDAY;
			}
			if (isPreviousButton())
			{
				TimerState = TIMER1;
				LoadDay = FRIDAY;
			}
			if (isBackButton())
			{
				TimerState = TIMER1;
				LoadDay = MONDAY;
				MainState = SHOW_LOADCALEN;
			}
			break;
		case SUNDAY:
			LCD1602_ClearBFR();
			LCD1602_PrintStringBFR(0, 0, "SUN  START 00:00");
			LCD1602_PrintStringBFR(1, 0, "TMR1   RUN 00:00");
			LoadTimer();
			if (isNextButton())
			{
				TimerState = TIMER1;
				LoadDay = MONDAY;
			}
			if (isPreviousButton())
			{
				TimerState = TIMER1;
				LoadDay = SATURDAY;
			}
			if (isBackButton())
			{
				TimerState = TIMER1;
				LoadDay = MONDAY;
				MainState = SHOW_LOADCALEN;
			}
			break;
		default:
			break;
	}
}

void CreateCalendar(void)
{
	switch (CreateModeState)
	{
		case SHOW_FULL_WEEK:
			LCD1602_PrintStringBFR(0,0,"<  FULL WEEK   >");
			if (isNextButton())
				CreateModeState = SHOW_ODD_DAYS;
			if (isPreviousButton())
				CreateModeState = SHOW_CHOOSE_DAYS;
			if (isBackButton())
			{
				CreateModeState = SHOW_FULL_WEEK;
				MainState = SHOW_CREATECALEN;
			}
			if (isEnterButton())
				CreateModeState = FULL_WEEK;
			break;
		case SHOW_ODD_DAYS:
			LCD1602_PrintStringBFR(0,0,"<   ODD DAYS   >");
			if (isNextButton())
				CreateModeState = SHOW_EVEN_DAYS;
			if (isPreviousButton())
				CreateModeState = SHOW_FULL_WEEK;
			if (isBackButton())
			{
				CreateModeState = SHOW_FULL_WEEK;
				MainState = SHOW_CREATECALEN;
			}
			if (isEnterButton())
				CreateModeState = ODD_DAYS;
			break;
		case SHOW_EVEN_DAYS:
			LCD1602_PrintStringBFR(0,0,"<   EVEN DAYS  >");
			if (isNextButton())
				CreateModeState = SHOW_CHOOSE_DAYS;
			if (isPreviousButton())
				CreateModeState = SHOW_ODD_DAYS;
			if (isBackButton())
			{
				CreateModeState = SHOW_FULL_WEEK;
				MainState = SHOW_CREATECALEN;
			}
			if (isEnterButton())
				CreateModeState = EVEN_DAYS;
			break;
		case SHOW_CHOOSE_DAYS:
			LCD1602_PrintStringBFR(0,0,"<  CHOOSE DAYS >");
			if (isNextButton())
				CreateModeState = SHOW_FULL_WEEK;
			if (isPreviousButton())
				CreateModeState = SHOW_EVEN_DAYS;
			if (isBackButton())
			{
				CreateModeState = SHOW_FULL_WEEK;
				MainState = SHOW_CREATECALEN;
			}
			if (isEnterButton())
				CreateModeState = CHOOSE_DAYS;
			break;
		case FULL_WEEK:
			LCD1602_ClearBFR();
			if (isBackButton())
				CreateModeState = SHOW_FULL_WEEK;
			break;
		case ODD_DAYS:
			LCD1602_ClearBFR();
			if (isBackButton())
				CreateModeState = SHOW_ODD_DAYS;
			break;
		case EVEN_DAYS:
			LCD1602_ClearBFR();
			if (isBackButton())
				CreateModeState = SHOW_EVEN_DAYS;
			break;
		case CHOOSE_DAYS:
			LCD1602_ClearBFR();
			if (isBackButton())
				CreateModeState = SHOW_CHOOSE_DAYS;
			break;
		default:
			break;
	}
}
void CheckWatering(uint8_t* day_watering)
{
	uint8_t count = 0;
	int16_t total_minutes;
	int16_t current_minutes;
	for (count=0; count<64; count=count+4)
	{
		if (day_watering[count+2] !=0 || day_watering[count+3] !=0)
		{
			// Calculate a finished time
			total_minutes = day_watering[count+2]*60 + day_watering[count+3];
			current_minutes = (hour - day_watering[count])*60 + minute - day_watering[count+1];
			
			//Check this time for watering
			if (current_minutes >= 0 && current_minutes < total_minutes)
			{
				isWatering = 1;
				break;
			}
			else
				isWatering = 0;
				LED2(0);
		}
	}
}
void Watering(void)
{
	switch (day)
	{
		case MONDAY:
			CheckWatering(Monday);
			break;
		case TUESDAY:
			CheckWatering(Tuesday);
			break;
		case WEDNESDAY:
			CheckWatering(Wednesday);
			break;
		case THUSDAY:
			CheckWatering(Thusday);
			break;
		case FRIDAY:
			CheckWatering(Friday);
			break;
		case SATURDAY:
			CheckWatering(Saturday);
			break;
		case SUNDAY:
			CheckWatering(Sunday);
			break;
		default:
			break;
	}
	if (isWatering)
		{	LED1(1);}
	else
		LED1(0);
}
/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Retargets the C library printf function to the USART.
  * @param  None
  * @retval None
  */

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif

/**
  * @}
  */


/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
